In [1]:
import pandas as pd
import re
pd.set_option("display.max_rows", 120)

In [2]:
#Abrimosel archivo para observar los datos que tenemos en el archivo attacks.csv
df_data=pd.read_csv("data/attacks.csv",encoding='cp1252')
df_data

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
0,2018.06.25,25-Jun-2018,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,...,White shark,"R. Collier, GSAF",2018.06.25-Wolfe.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.25,2018.06.25,6303.0,NaN,NaN
1,2018.06.18,18-Jun-2018,2018.0,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,Adyson McNeely,F,...,NaN,"K.McMurray, TrackingSharks.com",2018.06.18-McNeely.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.18,2018.06.18,6302.0,NaN,NaN
2,2018.06.09,09-Jun-2018,2018.0,Invalid,USA,Hawaii,"Habush, Oahu",Surfing,John Denges,M,...,NaN,"K.McMurray, TrackingSharks.com",2018.06.09-Denges.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.09,2018.06.09,6301.0,NaN,NaN
3,2018.06.08,08-Jun-2018,2018.0,Unprovoked,AUSTRALIA,New South Wales,Arrawarra Headland,Surfing,male,M,...,2 m shark,"B. Myatt, GSAF",2018.06.08-Arrawarra.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.08,2018.06.08,6300.0,NaN,NaN
4,2018.06.04,04-Jun-2018,2018.0,Provoked,MEXICO,Colima,La Ticla,Free diving,Gustavo Ramos,M,...,"Tiger shark, 3m",A .Kipper,2018.06.04-Ramos.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.04,2018.06.04,6299.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
25718,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25719,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25720,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25721,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25722,xx,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [3]:
#eliminamos todas las filas que no tienen informacion
df_data_Content=df_data.drop(range(6302, 25723), axis=0)

In [4]:
#Con el analisis exploratorio planteamos una hipotesis y en funcion de ella se recopilaron las columnas que no van a propiciar 
#la informacion necesaria para el analisis
df_data_Content=df_data_Content[["original order", "Case Number", "Name", "Year", "Country", "Area", "Sex "]]

#renombramos las columnas
df_data_Content.columns = ["Original Order", "Case Number", "Name", "Year", "Country", "Area", "Sex"]

In [5]:
#procedemos a reemplazar los valores NaN de la columna Year por 0 para poder filtra la imformacion entre los años 1990 y 1999
df_data_Content['Year'] = df_data_Content['Year'].fillna(0)

In [6]:
#la columna Year esta en float por lo que la convertimos a int para que asi no aparesca el .0 al lado de los años
df_data_Content.Year =df_data_Content.Year.astype(int)

#procedemos a filtrar la informacion 
df_data_Content_Year=df_data_Content[(df_data_Content.Year >= 1990) & (df_data_Content.Year <= 1999)]
df_data_Content_Year

,Original Order,Case Number,Name,Year,Country,Area,Sex
2079,4224.0,1999.12.31.c,Tim Wild,1999,NEW ZEALAND,South Island,M
2080,4223.0,1999.12.31.b,Jennifer McDowell,1999,NEW ZEALAND,South Island,F
2081,4222.0,1999.12.31.a,Genna Hayward,1999,NEW ZEALAND,South Island,F
2082,4221.0,1999.12.26,Alton Cicero da Silva,1999,BRAZIL,Pernambuco,M
2083,4220.0,1999.12.14,Joo Whan Hong,1999,USA,California,M
...,...,...,...,...,...,...,...
2644,3659.0,1990.03.05,Wagner Cataldo-Beugleu,1990,REUNION,Sainte-Marie,M
2645,3658.0,1990.02.17,Roy T. Tanaka,1990,USA,Hawaii,M
2646,3657.0,1990.02.05,Bruce Ferguson,1990,USA,Florida,M
2647,3656.0,1990.01.12,Sean Sullivan,1990,USA,California,M
2648,3655.0,1990.00.00,male,1990,USA,Florida,M

In [7]:
#Ya filtardo verificamos si segun el orden original de cada final existe algun dato duplicado, si da 0 es que no hay ningun caso duplicado en nuestra data filtrada
df_data_Content_Year["Original Order"].duplicated().sum()

0

In [8]:
#Como el numero de caso solo tiene formato al principio y luego no continua, sin embargo el numero de caso coincide con el orden
#orden original lo que realizamos es una sustitucion de los valores de la columna de numero de casos por el formato ND-#### 
#los #### corresponden a los valores de la columna orden original
#como hemos eliminado columnas procedemos a hacer un reset del index para garantizar que la sustitucion entre las dos columnas 
#ocurra en la misma fila.

df_data_Content_Year=df_data_Content_Year.reset_index()
for i in range (0,569):  
    df_data_Content_Year.loc[df_data_Content_Year.index == i, 'Case Number'] = "ND-"+str(int(df_data_Content_Year['Original Order'][i]))
    
#eliminamos las columnas inecesarias 
df_data_clean=df_data_Content_Year.drop(['Original Order','index'], axis=1)


df_data_clean

    Case Number                    Name  Year      Country          Area Sex
0       ND-4224                Tim Wild  1999  NEW ZEALAND  South Island   M
1       ND-4223       Jennifer McDowell  1999  NEW ZEALAND  South Island   F
2       ND-4222          Genna Hayward   1999  NEW ZEALAND  South Island   F
3       ND-4221   Alton Cicero da Silva  1999       BRAZIL    Pernambuco   M
4       ND-4220           Joo Whan Hong  1999          USA    California   M
..          ...                     ...   ...          ...           ...  ..
564     ND-3659  Wagner Cataldo-Beugleu  1990      REUNION  Sainte-Marie   M
565     ND-3658           Roy T. Tanaka  1990          USA        Hawaii   M
566     ND-3657          Bruce Ferguson  1990          USA       Florida   M
567     ND-3656           Sean Sullivan  1990          USA    California   M
568     ND-3655                    male  1990          USA       Florida   M

[569 rows x 6 columns]

In [9]:
#procederemos a limpiar la columna nombre, para ello revizamos la columna y detectamos varios patrones los cuales procederemos
#a elinimar, luego todo lo que quede si  contenido, o tenga "male", "female", lo remplazaremos con "Sin Identificar"

patron=[r'\(.*\)', r'^\w.*\.$', r'\d.*\.?', r'^\w.*\:', r'^\w.\w$', r'^[a-z].*[a-z]$', r'[A-Z]\W$', r'^[A-Z]\s.*\w$', r'^\w.*\”$']
for i in patron:
        df_data_clean.Name=df_data_clean.Name.replace(regex=i, value= '')
df_data_clean.Name=df_data_clean.Name.replace(["female", "male", '', ' '], "Sin Identificar")
df_data_clean.Name=df_data_clean.Name.fillna("Sin Identificar")


#con los patrones quito
#los parentesis y su contenido
#todo lo que inicia con una letra o numero y termina con punto
#todo lo que inicia con una letra o numero y termina con punto
#todo lo que es numero
#todo lo que inicia con una letra o numero y finalice con ":"
#todo lo que inicia en una letra seguido de un punto y lego otra letra 
#todo lo inica con letra mayuscula seguido de un espacio y finalice en letra
#todo lo que inicie en una letra y finalice en commillar


# limpieza de la columna Country
df_data_clean.Country=df_data_clean.Country.replace("REUNION", value= 'RE-UNION')

#Limpieza de la columan Area
patron2=[r'\,.*\w', r'^\w.*\/', r'^\d.*\w$' ]
for i in patron2:
        df_data_clean.Name=df_data_clean.Name.replace(regex=i, value= '')

df_data_clean

    Case Number                    Name  Year      Country          Area Sex
0       ND-4224                Tim Wild  1999  NEW ZEALAND  South Island   M
1       ND-4223       Jennifer McDowell  1999  NEW ZEALAND  South Island   F
2       ND-4222          Genna Hayward   1999  NEW ZEALAND  South Island   F
3       ND-4221   Alton Cicero da Silva  1999       BRAZIL    Pernambuco   M
4       ND-4220           Joo Whan Hong  1999          USA    California   M
..          ...                     ...   ...          ...           ...  ..
564     ND-3659  Wagner Cataldo-Beugleu  1990     RE-UNION  Sainte-Marie   M
565     ND-3658           Roy T. Tanaka  1990          USA        Hawaii   M
566     ND-3657          Bruce Ferguson  1990          USA       Florida   M
567     ND-3656           Sean Sullivan  1990          USA    California   M
568     ND-3655         Sin Identificar  1990          USA       Florida   M

[569 rows x 6 columns]

In [ ]:
df_data_clean.to_csv('data/Attacks_cleaner.csv')